veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.WUTMODE */
#define IFX_PMS_PMSWSTAT_WUTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.WUTMODE */
#define IFX_PMS_PMSWSTAT_WUTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.WUTMODE */
#define IFX_PMS_PMSWSTAT_WUTMODE_OFF (26u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.ESR0INT */
#define IFX_PMS_PMSWSTAT_ESR0INT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.ESR0INT */
#define IFX_PMS_PMSWSTAT_ESR0INT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.ESR0INT */
#define IFX_PMS_PMSWSTAT_ESR0INT_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.ESR1INT */
#define IFX_PMS_PMSWSTAT_ESR1INT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.ESR1INT */
#define IFX_PMS_PMSWSTAT_ESR1INT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.ESR1INT */
#define IFX_PMS_PMSWSTAT_ESR1INT_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PINAINT */
#define IFX_PMS_PMSWSTAT_PINAINT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PINAINT */
#define IFX_PMS_PMSWSTAT_PINAINT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PINAINT */
#define IFX_PMS_PMSWSTAT_PINAINT_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PINBINT */
#define IFX_PMS_PMSWSTAT_PINBINT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PINBINT */
#define IFX_PMS_PMSWSTAT_PINBINT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PINBINT */
#define IFX_PMS_PMSWSTAT_PINBINT_OFF (31u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSWSTAT2_ESR0WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSWSTAT2_ESR0WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSWSTAT2_ESR0WKP_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSWSTAT2_ESR1WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSWSTAT2_ESR1WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSWSTAT2_ESR1WKP_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINAWKP */
#define IFX_PMS_PMSWSTAT2_PINAWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINAWKP */
#define IFX_PMS_PMSWSTAT2_PINAWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINAWKP */
#define IFX_PMS_PMSWSTAT2_PINAWKP_OFF (2u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINBWKP */
#define IFX_PMS_PMSWSTAT2_PINBWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINBWKP */
#define IFX_PMS_PMSWSTAT2_PINBWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINBWKP */
#define IFX_PMS_PMSWSTAT2_PINBWKP_OFF (3u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PWRWKP */
#define IFX_PMS_PMSWSTAT2_PWRWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PWRWKP */
#define IFX_PMS_PMSWSTAT2_PWRWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PWRWKP */
#define IFX_PMS_PMSWSTAT2_PWRWKP_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.SCRWKP */
#define IFX_PMS_PMSWSTAT2_SCRWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.SCRWKP */
#define IFX_PMS_PMSWSTAT2_SCRWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.SCRWKP */
#define IFX_PMS_PMSWSTAT2_SCRWKP_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSWSTAT2_PORSTWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSWSTAT2_PORSTWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSWSTAT2_PORSTWKP_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.WUTWKP */
#define IFX_PMS_PMSWSTAT2_WUTWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.WUTWKP */
#define IFX_PMS_PMSWSTAT2_WUTWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.WUTWKP */
#define IFX_PMS_PMSWSTAT2_WUTWKP_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR0OVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR0OVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR0OVRUN_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR1OVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR1OVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSWSTAT2_ESR1OVRUN_OFF (9u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSWSTAT2_PINAOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSWSTAT2_PINAOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSWSTAT2_PINAOVRUN_OFF (10u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSWSTAT2_PINBOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSWSTAT2_PINBOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSWSTAT2_PINBOVRUN_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWSTAT2_VDDSTBYEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWSTAT2_VDDSTBYEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWSTAT2_VDDSTBYEN_OFF (12u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSWSTAT2_SCROVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSWSTAT2_SCROVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSWSTAT2_SCROVRUN_OFF (13u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSWSTAT2_PORSTOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSWSTAT2_PORSTOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSWSTAT2_PORSTOVRUN_OFF (14u)

