veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.M2TOFF */
#define IFX_PMS_EVRSDCTRL5_M2TOFF_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.M2TOFF */
#define IFX_PMS_EVRSDCTRL5_M2TOFF_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.M2TOFF */
#define IFX_PMS_EVRSDCTRL5_M2TOFF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.M2TON */
#define IFX_PMS_EVRSDCTRL5_M2TON_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.M2TON */
#define IFX_PMS_EVRSDCTRL5_M2TON_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.M2TON */
#define IFX_PMS_EVRSDCTRL5_M2TON_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.M2S0COEFF */
#define IFX_PMS_EVRSDCTRL5_M2S0COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.M2S0COEFF */
#define IFX_PMS_EVRSDCTRL5_M2S0COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.M2S0COEFF */
#define IFX_PMS_EVRSDCTRL5_M2S0COEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.M2DEADBD */
#define IFX_PMS_EVRSDCTRL5_M2DEADBD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.M2DEADBD */
#define IFX_PMS_EVRSDCTRL5_M2DEADBD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.M2DEADBD */
#define IFX_PMS_EVRSDCTRL5_M2DEADBD_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.M2ADCZB */
#define IFX_PMS_EVRSDCTRL5_M2ADCZB_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.M2ADCZB */
#define IFX_PMS_EVRSDCTRL5_M2ADCZB_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.M2ADCZB */
#define IFX_PMS_EVRSDCTRL5_M2ADCZB_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.M2SKIP */
#define IFX_PMS_EVRSDCTRL5_M2SKIP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.M2SKIP */
#define IFX_PMS_EVRSDCTRL5_M2SKIP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.M2SKIP */
#define IFX_PMS_EVRSDCTRL5_M2SKIP_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SVINTH */
#define IFX_PMS_EVRSDCTRL6_SVINTH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SVINTH */
#define IFX_PMS_EVRSDCTRL6_SVINTH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SVINTH */
#define IFX_PMS_EVRSDCTRL6_SVINTH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SVOTH */
#define IFX_PMS_EVRSDCTRL6_SVOTH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SVOTH */
#define IFX_PMS_EVRSDCTRL6_SVOTH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SVOTH */
#define IFX_PMS_EVRSDCTRL6_SVOTH_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL6_SINCLO_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL6_SINCLO_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL6_SINCLO_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL6_SINCHI_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL6_SINCHI_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL6_SINCHI_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVNI */
#define IFX_PMS_EVRSDCTRL7_DRVNI_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVNI */
#define IFX_PMS_EVRSDCTRL7_DRVNI_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVNI */
#define IFX_PMS_EVRSDCTRL7_DRVNI_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL7_DRVPCBF_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL7_DRVPCBF_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL7_DRVPCBF_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL7_DRVP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL7_DRVP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL7_DRVP_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL7_DRVSLOMODE_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL7_DRVSLOMODE_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL7_DRVSLOMODE_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL7_DRVSPR_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL7_DRVSPR_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL7_DRVSPR_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL7_SYNCDIVFAC_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL7_SYNCDIVFAC_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL7_SYNCDIVFAC_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FBADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FBADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FBADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL8_FBADCSMP_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL8_FBADCSMP_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL8_FBADCSMP_OFF (8u)

