veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF5_M2VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF5_M2VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF5_M2VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF5_M2VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF5_M2VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF5_M2VIN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S3COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S3COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S3COEFFFRAC_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S2COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S2COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S2COEFFFRAC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2SRMPCOEFFFRAC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2SRMPCOEFFFRAC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2SRMPCOEFFFRAC_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG0_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG0_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG0_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG1_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG1_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG1_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG2_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG2_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG2_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF6_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF6_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF6_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG3_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG3_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG3_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG4_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG4_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF7_CT5REG4_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF7_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF7_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF7_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG0_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG0_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG0_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG1_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG1_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG1_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG2_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG2_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF8_CT33REG2_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF8_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF8_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF8_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG3_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG3_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG3_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG4_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG4_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF9_CT33REG4_OFF (8u)

